     A            R TAXTBLR
     A              TBTYPE         2        COLHDG('CUST' 'TYPE')
     A                                      TEXT('Customer type')
     A              TBTAXRT        7  4     COLHDG('TAX' 'RATE')
     A                                      TEXT('Override tax rate for type')
     A              TBDESC        30        COLHDG('DESCRIPTION')
     A              TBEFFDT         D       COLHDG('EFFECTIVE' 'DATE')
     A            K TBTYPE
